-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- ホスト: 127.0.0.1
-- 生成日時: 2023-06-16 10:40:36
-- サーバのバージョン： 10.4.28-MariaDB
-- PHP のバージョン: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `mydb`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `mytable`
--

CREATE TABLE `mytable` (
  `id` int(11) NOT NULL,
  `foo` varchar(100) DEFAULT NULL,
  `bar` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `mytable`
--

INSERT INTO `mytable` (`id`, `foo`, `bar`) VALUES
(32, 'い', -200),
(33, 'う', 300);

-- --------------------------------------------------------

--
-- テーブルの構造 `name bangou`
--

CREATE TABLE `name bangou` (
  `COL 1` varchar(2) DEFAULT NULL,
  `COL 2` varchar(4) DEFAULT NULL,
  `COL 3` varchar(13) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- テーブルのデータのダンプ `name bangou`
--

INSERT INTO `name bangou` (`COL 1`, `COL 2`, `COL 3`) VALUES
('番号', '名前', '電話番号'),
('1', '山田太郎', '090-0000-0000'),
('2', '田中太郎', '090-1111-1111'),
('3', '山本花子', '090-2222-2222'),
('4', '加藤次郎', '090-3333-3333');

-- --------------------------------------------------------

--
-- テーブルの構造 `productinfo`
--

CREATE TABLE `productinfo` (
  `id` int(11) NOT NULL,
  `productname` varchar(30) NOT NULL,
  `price` int(11) NOT NULL,
  `stock` int(11) NOT NULL,
  `imgfile` varchar(40) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `productinfo`
--

INSERT INTO `productinfo` (`id`, `productname`, `price`, `stock`, `imgfile`) VALUES
(1, 'イヤホン', 1500, 100, 'product6.png'),
(2, 'モバイルバッテリ', 3980, 10, ''),
(3, 'USB-TypeC接続ケーブル', 800, 50, ''),
(4, 'LOVOT', 500000, 5, '');

-- --------------------------------------------------------

--
-- テーブルの構造 `sihuto`
--

CREATE TABLE `sihuto` (
  `バイトID` varchar(2) DEFAULT NULL,
  `名前` varchar(4) DEFAULT NULL,
  `入出` varchar(1) DEFAULT NULL,
  `1日` varchar(1) DEFAULT NULL,
  `2日` varchar(5) DEFAULT NULL,
  `3日` varchar(5) DEFAULT NULL,
  `4日` varchar(5) DEFAULT NULL,
  `5日` varchar(1) DEFAULT NULL,
  `6日` varchar(1) DEFAULT NULL,
  `7日` varchar(1) DEFAULT NULL,
  `8日` varchar(1) DEFAULT NULL,
  `9日` varchar(1) DEFAULT NULL,
  `10日` varchar(2) DEFAULT NULL,
  `11日` varchar(2) DEFAULT NULL,
  `12日` varchar(2) DEFAULT NULL,
  `13日` varchar(2) DEFAULT NULL,
  `14日` varchar(2) DEFAULT NULL,
  `15日` varchar(2) DEFAULT NULL,
  `16日` varchar(2) DEFAULT NULL,
  `17日` varchar(2) DEFAULT NULL,
  `18日` varchar(2) DEFAULT NULL,
  `19日` varchar(2) DEFAULT NULL,
  `20日` varchar(2) DEFAULT NULL,
  `21日` varchar(2) DEFAULT NULL,
  `22日` varchar(2) DEFAULT NULL,
  `23日` varchar(2) DEFAULT NULL,
  `24日` varchar(2) DEFAULT NULL,
  `25日` varchar(2) DEFAULT NULL,
  `26日` varchar(2) DEFAULT NULL,
  `27日` varchar(2) DEFAULT NULL,
  `28日` varchar(2) DEFAULT NULL,
  `29日` varchar(2) DEFAULT NULL,
  `30日` varchar(2) DEFAULT NULL,
  `31日` varchar(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- テーブルのデータのダンプ `sihuto`
--

INSERT INTO `sihuto` (`バイトID`, `名前`, `入出`, `1日`, `2日`, `3日`, `4日`, `5日`, `6日`, `7日`, `8日`, `9日`, `10日`, `11日`, `12日`, `13日`, `14日`, `15日`, `16日`, `17日`, `18日`, `19日`, `20日`, `21日`, `22日`, `23日`, `24日`, `25日`, `26日`, `27日`, `28日`, `29日`, `30日`, `31日`) VALUES
('No', '氏名', '', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31'),
('', '', '', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木'),
('1', '山田太郎', '入', '', '8:00', '12:00', '12:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '14:00', '19:00', '20:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('2', '田中太郎', '入', '', '9:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '18:00', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('3', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('4', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('5', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('6', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('7', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('8', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('9', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('10', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- テーブルの構造 `sihuto2`
--

CREATE TABLE `sihuto2` (
  `バイトID` varchar(2) DEFAULT NULL,
  `名前` varchar(4) DEFAULT NULL,
  `入出` varchar(1) DEFAULT NULL,
  `6月1日` varchar(1) DEFAULT NULL,
  `6月2日` varchar(5) DEFAULT NULL,
  `6月3日` varchar(5) DEFAULT NULL,
  `6月4日` varchar(1) DEFAULT NULL,
  `6月5日` varchar(1) DEFAULT NULL,
  `6月6日` varchar(1) DEFAULT NULL,
  `6月7日` varchar(1) DEFAULT NULL,
  `6月8日` varchar(1) DEFAULT NULL,
  `6月9日` varchar(1) DEFAULT NULL,
  `6月10日` varchar(2) DEFAULT NULL,
  `COL 14` varchar(2) DEFAULT NULL,
  `COL 15` varchar(2) DEFAULT NULL,
  `COL 16` varchar(2) DEFAULT NULL,
  `COL 17` varchar(2) DEFAULT NULL,
  `COL 18` varchar(2) DEFAULT NULL,
  `COL 19` varchar(2) DEFAULT NULL,
  `COL 20` varchar(2) DEFAULT NULL,
  `COL 21` varchar(2) DEFAULT NULL,
  `COL 22` varchar(2) DEFAULT NULL,
  `COL 23` varchar(2) DEFAULT NULL,
  `COL 24` varchar(2) DEFAULT NULL,
  `COL 25` varchar(2) DEFAULT NULL,
  `COL 26` varchar(2) DEFAULT NULL,
  `COL 27` varchar(2) DEFAULT NULL,
  `COL 28` varchar(2) DEFAULT NULL,
  `COL 29` varchar(2) DEFAULT NULL,
  `COL 30` varchar(2) DEFAULT NULL,
  `COL 31` varchar(2) DEFAULT NULL,
  `COL 32` varchar(2) DEFAULT NULL,
  `COL 33` varchar(2) DEFAULT NULL,
  `COL 34` varchar(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- テーブルのデータのダンプ `sihuto2`
--

INSERT INTO `sihuto2` (`バイトID`, `名前`, `入出`, `6月1日`, `6月2日`, `6月3日`, `6月4日`, `6月5日`, `6月6日`, `6月7日`, `6月8日`, `6月9日`, `6月10日`, `COL 14`, `COL 15`, `COL 16`, `COL 17`, `COL 18`, `COL 19`, `COL 20`, `COL 21`, `COL 22`, `COL 23`, `COL 24`, `COL 25`, `COL 26`, `COL 27`, `COL 28`, `COL 29`, `COL 30`, `COL 31`, `COL 32`, `COL 33`, `COL 34`) VALUES
('No', '氏名', '', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31'),
('', '', '', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木', '金', '土', '日', '月', '火', '水', '木'),
('1', '山田太郎', '入', '', '8', '1', '1', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '1', '1', '2', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('2', '田中太郎', '入', '', '9', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '1', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('3', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('4', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('5', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('6', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('7', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('8', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('9', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('10', '', '入', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', ''),
('', '', '出', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- テーブルの構造 `table1`
--

CREATE TABLE `table1` (
  `id` int(11) NOT NULL,
  `varcharA` int(11) NOT NULL,
  `intA` int(11) NOT NULL,
  `intB` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `table1`
--

INSERT INTO `table1` (`id`, `varcharA`, `intA`, `intB`) VALUES
(1, 0, 1280, 1),
(2, 0, 2980, 0),
(3, 0, 198, 3),
(4, 0, 3980, 5),
(5, 0, 990, 121),
(6, 0, 1500, 100),
(7, 0, 1980, 52),
(8, 0, 256, 22),
(9, 0, 512, 27),
(10, 0, 3333, 4);

-- --------------------------------------------------------

--
-- テーブルの構造 `アルバイト情報テーブル`
--

CREATE TABLE `アルバイト情報テーブル` (
  `バイトID` int(11) NOT NULL,
  `名前` varchar(30) DEFAULT NULL,
  `電話番号` varchar(30) DEFAULT NULL,
  `時給` decimal(8,0) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `アルバイト情報テーブル`
--

INSERT INTO `アルバイト情報テーブル` (`バイトID`, `名前`, `電話番号`, `時給`) VALUES
(1, '山田太郎', '09011111111', 1200),
(2, '田中太郎', '09022222222', 1200);

-- --------------------------------------------------------

--
-- テーブルの構造 `シフトテーブル`
--

CREATE TABLE `シフトテーブル` (
  `バイトID` int(11) DEFAULT NULL,
  `日付` date NOT NULL,
  `開始` datetime NOT NULL,
  `終了` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `シフトテーブル`
--

INSERT INTO `シフトテーブル` (`バイトID`, `日付`, `開始`, `終了`) VALUES
(1, '2023-06-16', '2023-06-16 08:00:00', '2023-06-16 14:00:00'),
(2, '2023-06-17', '2023-06-17 09:00:00', '2023-06-17 19:00:00');

-- --------------------------------------------------------

--
-- テーブルの構造 `修正後シフトテーブル`
--

CREATE TABLE `修正後シフトテーブル` (
  `バイトID` int(11) DEFAULT NULL,
  `日付` date NOT NULL,
  `開始` datetime NOT NULL,
  `終了` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- テーブルのデータのダンプ `修正後シフトテーブル`
--

INSERT INTO `修正後シフトテーブル` (`バイトID`, `日付`, `開始`, `終了`) VALUES
(1, '2023-06-16', '2023-06-16 10:00:00', '2023-06-16 19:00:00'),
(2, '2023-06-17', '2023-06-17 12:00:00', '2023-06-17 19:00:00');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `mytable`
--
ALTER TABLE `mytable`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `productinfo`
--
ALTER TABLE `productinfo`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `アルバイト情報テーブル`
--
ALTER TABLE `アルバイト情報テーブル`
  ADD PRIMARY KEY (`バイトID`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `mytable`
--
ALTER TABLE `mytable`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- テーブルの AUTO_INCREMENT `productinfo`
--
ALTER TABLE `productinfo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- テーブルの AUTO_INCREMENT `アルバイト情報テーブル`
--
ALTER TABLE `アルバイト情報テーブル`
  MODIFY `バイトID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
